---
kind: method
id: M:Autodesk.Revit.DB.ViewPlan.GetViewRange
zh: 平面视图、平面图
source: html/0a8b7c58-406d-b801-5921-8b23568806be.htm
---
# Autodesk.Revit.DB.ViewPlan.GetViewRange Method

**中文**: 平面视图、平面图

Gets the view range.

## Syntax (C#)
```csharp
public PlanViewRange GetViewRange()
```

## Returns
The view range.